/* errAuthorizationInvalidSet */
"-60001" = "Uprawnienia autoryzacji są niewłaściwe.";

/* errAuthorizationInvalidRef */
"-60002" = "Informacje o autoryzacji są nieprawidłowe.";

/* errAuthorizationInvalidTag */
"-60003" = "Znacznik autoryzacji jest nieprawidłowy.";

/* errAuthorizationInvalidPointer */
"-60004" = "Zwrócona autoryzacja jest nieprawidłowa.";

/* errAuthorizationDenied */
"-60005" = "Nastąpiła odmowa autoryzacji.";

/* errAuthorizationCanceled */
"-60006" = "Autoryzacja została anulowana przez użytkownika.";

/* errAuthorizationInteractionNotAllowed */
"-60007" = "Nastąpiła odmowa autoryzacji, gdyż współdziałanie użytkownika nie było możliwe.";

/* errAuthorizationInternal */
"-60008" = "Nie można uzyskać autoryzacji dla tej operacji.";

/* errAuthorizationExternalizeNotAllowed */
"-60009" = "Nie jest możliwe przekształcenie tej autoryzacji do formatu zewnętrznego.";

/* errAuthorizationInternalizeNotAllowed */
"-60010" = "Nie jest możliwe utworzenie autoryzacji z formatu zewnętrznego.";

/* errAuthorizationInvalidFlags */
"-60011" = "Podane sygnalizatory opcji są nieprawidłowe dla tej operacji autoryzacji.";

/* errAuthorizationToolExecuteFailure */
"-60031" = "Nie można było uruchomić podanego programu.";

/* errAuthorizationToolEnvironmentError */
"-60032" = "Zwrócony został nieprawidłowy status podczas uruchomienia uprzywilejowanego narzędzia.";

/* errAuthorizationBadAddress */
"-60033" = "Żądany adres gniazda jest nieprawidłowy (musi być od 0 do 1023 włącznie).";

/* errSSLProtocol */
"-9800" = "Błąd protokołu SSL";

/* errSSLNegotiation */
"-9801" = "Błąd negocjacji Cipher Suite";

/* errSSLFatalAlert */
"-9802" = "Alarm krytyczny";

/* errSSLWouldBlock */
"-9803" = "Możliwa blokada I/O (niekrytyczna)";

/* errSSLSessionNotFound */
"-9804" = "próba przywrócenia nieznanej sesji";

/* errSSLClosedGraceful */
"-9805" = "połączenie zamknięte bezawaryjnie";

/* errSSLClosedAbort */
"-9806" = "połączenie zamknięte przez błąd";

/* errSSLXCertChainInvalid */
"-9807" = "nieprawidłowy łańcuch certyfikatów";

/* errSSLBadCert */
"-9808" = "zły format certyfikatu";

/* errSSLCrypto */
"-9809" = "zasadniczy błąd kryptograficzny";

/* errSSLInternal */
"-9810" = "Błąd wewnętrzny";

/* errSSLModuleAttach */
"-9811" = "błąd dołączenia modułu";

/* errSSLUnknownRootCert */
"-9812" = "ważny łańcuch certyfikatów, nieznany certyfikat główny";

/* errSSLNoRootCert */
"-9813" = "łańcuch certyfikatów niezweryfikowany przez certyfikat główny";

/* errSSLCertExpired */
"-9814" = "w łańcuchu wygasł certyfikat";

/* errSSLCertNotYetValid */
"-9815" = "w łańcuch jest certyfikat jeszcze nieważny";

/* errSSLClosedNoNotify */
"-9816" = "serwer zamknął sesję bez powiadomienia";

/* errSSLBufferOverflow */
"-9817" = "zapewniono niewystarczający bufor";

/* errSSLBadCipherSuite */
"-9818" = "zły SSLCipherSuite";

/* errSSLPeerUnexpectedMsg */
"-9819" = "odebrano nieoczekiwany komunikat";

/* errSSLPeerBadRecordMac */
"-9820" = "zły MAC";

/* errSSLPeerDecryptionFail */
"-9821" = "odszyfrowanie nie powiodło się";

/* errSSLPeerRecordOverflow */
"-9822" = "przepełnienie rekordu";

/* errSSLPeerDecompressFail */
"-9823" = "błąd odkompresowania";

/* errSSLPeerHandshakeFail */
"-9824" = "błąd potwierdzenia uzgodnień";

/* errSSLPeerBadCert */
"-9825" = "zły certyfikat";

/* errSSLPeerUnsupportedCert */
"-9826" = "zły, nieobsługiwany format certyfikatu";

/* errSSLPeerCertRevoked */
"-9827" = "certyfikat odwołany";

/* errSSLPeerCertExpired */
"-9828" = "certyfikat wygasł";

/* errSSLPeerCertUnknown */
"-9829" = "nieznany certyfikat";

/* errSSLIllegalParam */
"-9830" = "nielegalny parametr";

/* errSSLPeerUnknownCA */
"-9831" = "nieznany Urząd certyfikacyjny";

/* errSSLPeerAccessDenied */
"-9832" = "dostęp zabroniony";

/* errSSLPeerDecodeError */
"-9833" = "błąd odkodowania";

/* errSSLPeerDecryptError */
"-9834" = "błąd odszyfrowania";

/* errSSLPeerExportRestriction */
"-9835" = "ograniczenia eksportowania";

/* errSSLPeerProtocolVersion */
"-9836" = "zła wersja protokołu";

/* errSSLPeerInsufficientSecurity */
"-9837" = "niewystarczające zabezpieczenia";

/* errSSLPeerInternalError */
"-9838" = "błąd wewnętrzny";

/* errSSLPeerUserCancelled */
"-9839" = "anulowane przez użytkownika";

/* errSSLPeerNoRenegotiation */
"-9840" = "nie są dozwolone ponowne negocjacje";

/* errSSLServerAuthCompleted */
"-9841" = "certyfikat serwera jest ważny lub został zignorowany, jeśli wyłączono weryfikację";

/* errSSLClientCertRequested */
"-9842" = "serwer zażądał certyfikatu klienta";

/* errSSLHostNameMismatch */
"-9843" = "niezgodność nazwy równorzędnego hosta";

/* errSSLConnectionRefused */
"-9844" = "host równorzędny utracił połączenie przed odpowiedzią";

/* errSSLDecryptionFail */
"-9845" = "błąd odszyfrowania";

/* errSSLBadRecordMac */
"-9846" = "zły MAC";

/* errSSLRecordOverflow */
"-9847" = "przepełnienie rekordu";

/* errSSLBadConfiguration */
"-9848" = "błąd konfiguracji";

/* errSecSuccess */
"0" = "Brak błędu.";

/* errSecUnimplemented */
"-4" = "Funkcja lub operacja niezaimplementowana.";

/* errSecParam */
"-50" = "Co najmniej jeden z parametrów przekazanych do funkcji był nieprawidłowy.";

/* errSecAllocate */
"-108" = "Błąd alokacji pamięci.";

/* errSecNotAvailable */
"-25291" = "Żaden pęk kluczy nie jest dostępny. Konieczne może być ponowne uruchomienie komputera.";

/* errSecReadOnly */
"-25292" = "Ten pęk kluczy nie może być modyfikowany.";

/* errSecAuthFailed */
"-25293" = "Podany użytkownik lub hasło nie są poprawne.";

/* errSecNoSuchKeychain */
"-25294" = "Nie można było znaleźć podanego pęku kluczy.";

/* errSecInvalidKeychain */
"-25295" = "Wskazany pęk kluczy nie jest prawidłowym plikiem pęku kluczy.";

/* errSecDuplicateKeychain */
"-25296" = "Pęk kluczy z tą samą nazwą już istnieje.";

/* errSecDuplicateCallback */
"-25297" = "Wskazana funkcja wywołania zwrotnego jest już zainstalowana.";

/* errSecInvalidCallback */
"-25298" = "Wskazana funkcja wywołania zwrotnego nie jest poprawna.";

/* errSecDuplicateItem */
"-25299" = "Podana rzecz już istnieje w pęku kluczy.";

/* errSecItemNotFound */
"-25300" = "Nie można było znaleźć podanej rzeczy w pęku kluczy.";

/* errSecBufferTooSmall */
"-25301" = "Brak wystarczającej ilości pamięci, aby użyć wskazanej rzeczy.";

/* errSecDataTooLarge */
"-25302" = "Ta rzecz zawiera dane, które są zbyt duże lub w formacie, którego nie można wyświetlić.";

/* errSecNoSuchAttr */
"-25303" = "Wskazany atrybut nie istnieje.";

/* errSecInvalidItemRef */
"-25304" = "Wskazana rzecz już nie jest ważna. Mogła zostać usunięta z pęku kluczy.";

/* errSecInvalidSearchRef */
"-25305" = "Nie można przeszukiwać bieżącego pęku kluczy.";

/* errSecNoSuchClass */
"-25306" = "Wskazana rzecz raczej nie jest poprawnym elementem pęku kluczy.";

/* errSecNoDefaultKeychain */
"-25307" = "Nie można było znaleźć domyślnego pęku kluczy.";

/* errSecInteractionNotAllowed */
"-25308" = "Współdziałanie użytkownika nie jest dozwolone.";

/* errSecReadOnlyAttr */
"-25309" = "Wskazany atrybut nie mógł zostać zmodyfikowany.";

/* errSecWrongSecVersion */
"-25310" = "Ten pęk kluczy został utworzony w innej wersji systemu operacyjnego i nie może zostać otwarty.";

/* errSecKeySizeNotAllowed */
"-25311" = "Ta rzecz wskazuje na zbyt duży rozmiar pęku kluczy.";

/* errSecNoStorageModule */
"-25312" = "Nie można było wczytać wymaganego składnika (modułu przechowania danych). Niezbędne może być ponowne uruchomienie komputera.";

/* errSecNoCertificateModule */
"-25313" = "Nie można było wczytać wymaganego składnika (modułu certyfikatu). Niezbędne może być ponowne uruchomienie komputera.";

/* errSecNoPolicyModule */
"-25314" = "Nie można było wczytać wymaganego składnika (modułu metod). Niezbędne może być ponowne uruchomienie komputera.";

/* errSecInteractionRequired */
"-25315" = "Wymagane jest współdziałanie ze strony użytkownika lecz teraz nie jest możliwe.";

/* errSecDataNotAvailable */
"-25316" = "Zawartość tej rzeczy nie może zostać odczytana.";

/* errSecDataNotModifiable */
"-25317" = "Zawartość tej rzeczy nie może zostać zmodyfikowana.";

/* errSecCreateChainFailed */
"-25318" = "Nie można było znaleźć jednego lub więcej certyfikatów wymaganych do potwierdzenia ważności tego certyfikatu.";

/* errSecInvalidPrefsDomain */
"-25319" = "Wskazana domena preferencji nie jest ważna.";

/* errSecACLNotSimple */
"-25240" = "Wskazana lista kontroli dostępu nie jest w formie standardowej (prostej).";

/* errSecPolicyNotFound */
"-25241" = "Nie można było znaleźć wskazanych zasad.";

/* errSecInvalidTrustSetting */
"-25242" = "Wskazane ustawienia zaufania są niewłaściwe.";

/* errSecNoAccessForItem */
"-25243" = "Wskazana rzecz nie ma kontroli dostępu.";

/* errSecInvalidOwnerEdit */
"-25244" = "Niewłaściwa próba zmiany właściciela tej rzeczy.";

/* errSecTrustNotAvailable */
"-25245" = "Żadne rezultaty zaufania nie są dostępne.";

/* errSecUnsupportedFormat */
"-25256" = "Nieobsługiwany format importu/eksportu.";

/* errSecUnknownFormat */
"-25257" = "Nieznany format importu.";

/* errSecKeyIsSensitive */
"-25258" = "Zawartość klucza musi zostać osłonięta przed wyeksportowaniem.";

/* errSecMultiplePrivKeys */
"-25259" = "Dokonano próby importu wielu kluczy prywatnych.";

/* errSecPassphraseRequired */
"-25260" = "Do eksportu/importu wymagane jest hasło.";

/* errSecInvalidPasswordRef */
"-25261" = "Odnośnik hasła był niepoprawny.";

/* errSecInvalidTrustSettings */
"-25262" = "Rekord ustawień zaufania był uszkodzony.";

/* errSecNoTrustSettings */
"-25263" = "Nie znaleziono Ustawień zaufania.";

/* errSecPkcs12VerifyFailure */
"-25264" = "Weryfikacja MAC nie powiodła się podczas importu PKCS12.";

/* errSecDecode */
"-26275" = "Nie można było odkodować przekazanych danych.";

/* CSSMERR_CSP_INVALID_DATA_COUNT */
"-2147415768" = "Błędne wartości wektora buforów CSP.";

/* CSSMERR_CSP_INVALID_CONTEXT */
"-2147415760" = "Błędne wartości kryptograficznego kontekstu CSP.";

/* CSSMERR_CSP_STAGED_OPERATION_IN_PROGRESS */
"-2147415736" = "Błędne wartości CSP Staged Cryptographic API.";

/* CSSMERR_CSP_APPLE_PUBLIC_KEY_INCOMPLETE */
"-2147415039" = "* Podjęta została próba użycia klucza publicznego, który był niekompletny z powodu * braku parametrów specyficznych dla algorytmu.";

/* CSSMERR_CSP_APPLE_SIGNATURE_MISMATCH */
"-2147415038" = "niepowodzenie dopasowania podpisu kodu";

/* CSSMERR_CSP_APPLE_INVALID_KEY_START_DATE */
"-2147415037" = "Klucz StartDate/EndDate nieprawidłowy";

/* CSSMERR_CSPDL_APPLE_DL_CONVERSION_ERROR */
"-2147415035" = "kody błędów synchronizacji pęków kluczy";

/* CSSMERR_CSP_APPLE_SSLv2_ROLLBACK */
"-2147415034" = "Sprawdzenie dopełnienia SSLv2: wykryto wycofanie ataku";

/* CSSMERR_APPLEDL_INVALID_OPEN_PARAMETERS */
"-2147412992" = "Argument OpenParameters przekazany do CSSM_DL_DbCreate lub CSSM_DL_DbOpen nie był NULL, ani poprawnym wskaźnikiem do poprawnej struktury CSSM_APPLEDL_OPEN_PARAMETERS.";

/* CSSMERR_APPLEDL_DISK_FULL */
"-2147412991" = "operacja nie powiodła się, gdyż dysk był pełny";

/* CSSMERR_APPLEDL_QUOTA_EXCEEDED */
"-2147412990" = "operacja nie powiodła się, gdyż przekroczono kwotę dyskową";

/* CSSMERR_APPLEDL_FILE_TOO_BIG */
"-2147412989" = "operacja nie powiodła się, gdyż plik był zbyt duży";

/* CSSMERR_APPLEDL_INVALID_DATABASE_BLOB */
"-2147412988" = "wewnętrzne informacje bazy danych pęku kluczy („blob”) są niepoprawne";

/* CSSMERR_APPLEDL_INCOMPATIBLE_DATABASE_BLOB */
"-2147412986" = "wewnętrzne informacje bazy danych dla wersji formatu danych wewnętrznych („blob”) są niepoprawne";

/* CSSMERR_APPLETP_HOSTNAME_MISMATCH */
"-2147408896" = "Niezgodna nazwa hosta";

/* CSSMERR_APPLETP_UNKNOWN_CRITICAL_EXTEN */
"-2147408895" = "Niezrozumiałe rozszerzenie z sygnalizatorem Critical jako prawda";

/* CSSMERR_APPLETP_NO_BASIC_CONSTRAINTS */
"-2147408894" = "Wymagane rozszerzenie Basic Constraints dla każdej z zasad, lecz nie jest obecne";

/* CSSMERR_APPLETP_INVALID_CA */
"-2147408893" = "Nieprawidłowy BasicConstraints.CA";

/* CSSMERR_APPLETP_INVALID_AUTHORITY_ID */
"-2147408892" = "Nieprawidłowy ID klucza urzędu";

/* CSSMERR_APPLETP_INVALID_SUBJECT_ID */
"-2147408891" = "Nieprawidłowy ID klucza obiektu";

/* CSSMERR_APPLETP_INVALID_KEY_USAGE */
"-2147408890" = "Nieprawidłowe użycie klucza dla zasad";

/* CSSMERR_APPLETP_INVALID_EXTENDED_KEY_USAGE */
"-2147408889" = "Nieprawidłowe rozszerzone użycie klucza dla zasad";

/* CSSMERR_APPLETP_INVALID_ID_LINKAGE */
"-2147408888" = "Niewłaściwe połączenie Obiekt/ID klucza urzędu";

/* CSSMERR_APPLETP_PATH_LEN_CONSTRAINT */
"-2147408887" = "przekroczone PathLengthConstraint";

/* CSSMERR_APPLETP_INVALID_ROOT */
"-2147408886" = "Grupa certyfikatu straciła ważność w certyfikacie głównym, który nie został samopotwierdzony";

/* CSSMERR_APPLETP_CRL_EXPIRED */
"-2147408885" = "CRL wygasł/jeszcze nie jest ważny";

/* CSSMERR_APPLETP_CRL_NOT_FOUND */
"-2147408883" = "Nie można znaleźć odpowiedniej listy CRL";

/* CSSMERR_APPLETP_CRL_SERVER_DOWN */
"-2147408882" = "wskazany serwer CRL jest wyłączony";

/* CSSMERR_APPLETP_CRL_BAD_URI */
"-2147408881" = "nieczytelny URL punktu dystrybucji CRL";

/* CSSMERR_APPLETP_UNKNOWN_CERT_EXTEN */
"-2147408880" = "Nieznany krytyczny certyfikat/rozszerzenie CRL";

/* CSSMERR_APPLETP_CRL_NOT_TRUSTED */
"-2147408878" = "CRL nie jest weryfikowalna z zaczepieniem lub root";

/* CSSMERR_APPLETP_CRL_INVALID_ANCHOR_CERT */
"-2147408877" = "CRL potwierdzone z niewiarygodnym root";

/* CSSMERR_APPLETP_CRL_POLICY_FAIL */
"-2147408876" = "Weryfikacja zasad CRL nie powiodła się";

/* CSSMERR_APPLETP_IDP_FAIL */
"-2147408875" = "Naruszenie rozszerzenia IssuingDistributionPoint";

/* CSSMERR_APPLETP_CERT_NOT_FOUND_FROM_ISSUER */
"-2147408874" = "Certyfikat nie znaleziony we wskazanym issuerAltName";

/* CSSMERR_APPLETP_BAD_CERT_FROM_ISSUER */
"-2147408873" = "Zły certyfikat uzyskany ze wskazanego issuerAltName";

/* CSSMERR_APPLETP_SMIME_EMAIL_ADDRS_NOT_FOUND */
"-2147408872" = "Niezgodność adresu email S/MIME";

/* CSSMERR_APPLETP_SMIME_BAD_EXT_KEY_USE */
"-2147408871" = "Nie znaleziono odpowiedniego S/MIME ExtendedKeyUsage";

/* CSSMERR_APPLETP_SMIME_BAD_KEY_USE */
"-2147408870" = "Niezgodność S/MIME KeyUsage";

/* CSSMERR_APPLETP_SMIME_KEYUSAGE_NOT_CRITICAL */
"-2147408869" = "S/MIME, certyfikat z KeyUsage z sygnalizatorem !critical";

/* CSSMERR_APPLETP_SMIME_NO_EMAIL_ADDRS */
"-2147408868" = "S/MIME, liść z pustą nazwą obiektu i bez adresu email * w SubjectAltName";

/* CSSMERR_APPLETP_SMIME_SUBJ_ALT_NAME_NOT_CRIT */
"-2147408867" = "S/MIME, liść z pustą nazwą obiektu, SubjectAltName * niekrytyczny";

/* CSSMERR_APPLETP_SSL_BAD_EXT_KEY_USE */
"-2147408866" = "Nie znaleziono odpowiedniego ExtendedKeyUsage SSL";

/* CSSMERR_APPLETP_OCSP_BAD_RESPONSE */
"-2147408865" = "nie dająca się zanalizować odpowiedź OCSP";

/* CSSMERR_APPLETP_OCSP_BAD_REQUEST */
"-2147408864" = "nie dające się zanalizować żądanie OCSP";

/* CSSMERR_APPLETP_OCSP_UNAVAILABLE */
"-2147408863" = "usługa OCSP niedostępna";

/* CSSMERR_APPLETP_OCSP_STATUS_UNRECOGNIZED */
"-2147408862" = "Status OCSP: nierozpoznany certyfikat";

/* CSSMERR_APPLETP_INCOMPLETE_REVOCATION_CHECK */
"-2147408861" = "sprawdzenie unieważnienia nie powiodło się dla każdego z certyfikatów";

/* CSSMERR_APPLETP_NETWORK_FAILURE */
"-2147408860" = "ogólny błąd sieci";

/* CSSMERR_APPLETP_OCSP_NOT_TRUSTED */
"-2147408859" = "Odpowiedź OCSP nie jest weryfikowalna z certyfikatem podstawowym lub głównym";

/* CSSMERR_APPLETP_OCSP_INVALID_ANCHOR_CERT */
"-2147408858" = "Odpowiedź OCSP potwierdzona z niewiarygodnym certyfikatem głównym";

/* CSSMERR_APPLETP_OCSP_SIG_ERROR */
"-2147408857" = "Błąd oznaczenia odpowiedzi OCSP";

/* CSSMERR_APPLETP_OCSP_NO_SIGNER */
"-2147408856" = "Nie znaleziono podpisu dla odpowiedzi OCSP";

/* CSSMERR_APPLETP_OCSP_RESP_MALFORMED_REQ */
"-2147408855" = "Status respondera OCSP: źle sformułowane żądanie";

/* CSSMERR_APPLETP_OCSP_RESP_INTERNAL_ERR */
"-2147408854" = "Status respondera OCSP: błąd wewnętrzny";

/* CSSMERR_APPLETP_OCSP_RESP_TRY_LATER */
"-2147408853" = "Status respondera OCSP: spróbuj później";

/* CSSMERR_APPLETP_OCSP_RESP_SIG_REQUIRED */
"-2147408852" = "Status respondera OCSP: wymagany podpis";

/* CSSMERR_APPLETP_OCSP_RESP_UNAUTHORIZED */
"-2147408851" = "Status respondera OCSP: brak autoryzacji";

/* CSSMERR_APPLETP_OCSP_NONCE_MISMATCH */
"-2147408850" = "Odpowiedź OCSP chwilowo nie spełniała oczekiwań żądania";

/* CSSMERR_APPLETP_CS_BAD_CERT_CHAIN_LENGTH */
"-2147408849" = "Nielegalna długość łańcucha certyfikatu dla Podpisywania kodu";

/* CSSMERR_APPLETP_CS_NO_BASIC_CONSTRAINTS */
"-2147408848" = "Brak podstawowych ograniczeń dla Podpisywania kodu";

/* CSSMERR_APPLETP_CS_BAD_PATH_LENGTH */
"-2147408847" = "Niewłaściwe PathLengthConstraint dla Podpisywania kodu";

/* CSSMERR_APPLETP_CS_NO_EXTENDED_KEY_USAGE */
"-2147408846" = "Brak ExtendedKeyUsage dla Podpisywania kodu";

/* CSSMERR_APPLETP_CODE_SIGN_DEVELOPMENT */
"-2147408845" = "Wykryto styl etapu konstrukcji kodu certyfikatu podpisującego";

/* CSSMERR_APPLETP_RS_BAD_CERT_CHAIN_LENGTH */
"-2147408844" = "Nielegalna długość łańcucha certyfikatu dla zasobów podpisu";

/* CSSMERR_APPLETP_RS_BAD_EXTENDED_KEY_USAGE */
"-2147408843" = "błędne rozszerzone użycie klucza dla podpisywania zasobów";

/* CSSMERR_APPLETP_TRUST_SETTING_DENY */
"-2147408842" = "Ustawienia zaufania: odrzuć";

/* CSSMERR_APPLETP_INVALID_EMPTY_SUBJECT */
"-2147408841" = "nieprawidłowy, pusty SubjectName";

/* CSSMERR_APPLETP_UNKNOWN_QUAL_CERT_STATEMENT */
"-2147408840" = "nieznany krytyczny ID instrukcji certyfikatu kwalifikowanego";

/* CSSMERR_APPLE_DOTMAC_REQ_QUEUED */
"-2147408796" = "żądanie certyfikacji ustawione w kolejce";

/* CSSMERR_APPLE_DOTMAC_REQ_REDIRECT */
"-2147408795" = "żądanie certyfikacji przekierowane";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ERR */
"-2147408794" = "serwer zgłosił błąd ogólny";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_PARAM */
"-2147408793" = "serwer zgłosił błąd parametru";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_AUTH */
"-2147408792" = "serwer zgłosił błąd autoryzacji";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_UNIMPL */
"-2147408791" = "serwer zgłosił błąd niezaimplementowania";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_NOT_AVAIL */
"-2147408790" = "raport serwera: niedostępne";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ALREADY_EXIST */
"-2147408789" = "raport serwera: już istnieje";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_SERVICE_ERROR */
"-2147408788" = "serwer zgłosił błąd usługi";

/* CSSMERR_APPLE_DOTMAC_REQ_IS_PENDING */
"-2147408787" = "dla podanego użytkownika żądanie już oczekuje";

/* CSSMERR_APPLE_DOTMAC_NO_REQ_PENDING */
"-2147408786" = "dla podanego użytkownika brak oczekujących żądań";

/* CSSMERR_APPLE_DOTMAC_CSR_VERIFY_FAIL */
"-2147408785" = "Nie można było zweryfikować CSR";

/* CSSMERR_APPLE_DOTMAC_FAILED_CONSISTENCY_CHECK */
"-2147408784" = "po sprawdzeniu spójności serwer zgłosił błędy";

/* errSecCSUnimplemented */
"-67072" = "niezaimplementowana cecha podpisu kodu";

/* errSecCSInvalidObjectRef */
"-67071" = "nieprawidłowe odwołania do API obiektu";

/* errSecCSInvalidFlags */
"-67070" = "podane nieprawidłowe lub niewłaściwe sygnalizatory API";

/* errSecCSObjectRequired */
"-67069" = "wskaźnik do wymaganego argumentu był NULL";

/* errSecCSStaticCodeNotFound */
"-67068" = "nie można znaleźć na dysku obiektu kodu";

/* errSecCSUnsupportedGuestAttributes */
"-67067" = "nie można zlokalizować gości przy pomocy tego zestawu atrybutów";

/* errSecCSInvalidAttributeValues */
"-67066" = "podane wartości atrybutów są nieprawidłowe";

/* errSecCSNoSuchCode */
"-67065" = "host nie ma gości z żądanymi atrybutami";

/* errSecCSMultipleGuests */
"-67064" = "host ma wielu gości z tą wartością atrybutu";

/* errSecCSGuestInvalid */
"-67063" = "tożsamość kodu została unieważniona";

/* errSecCSUnsigned */
"-67062" = "obiekt kodu nie jest podpisany";

/* errSecCSSignatureFailed */
"-67061" = "zmodyfikowany kod lub podpis";

/* errSecCSSignatureNotVerifiable */
"-67060" = "podpisu nie można przeczytać, np. z powodu systemu plików, który odwzorowuje root na użytkownika bez przywilejów";

/* errSecCSSignatureUnsupported */
"-67059" = "nieobsługiwany typ lub wersja podpisu";

/* errSecCSBadDictionaryFormat */
"-67058" = "wymagany plik .plist lub zasób jest źle sformowany";

/* errSecCSResourcesNotSealed */
"-67057" = "zasoby nie są opieczętowane podpisem";

/* errSecCSResourcesNotFound */
"-67056" = "nie można znaleźć opieczętowanych zasobów w kodzie";

/* errSecCSResourcesInvalid */
"-67055" = "katalog opieczętowanych zasobów jest niepoprawny";

/* errSecCSBadResource */
"-67054" = "brak opieczętowanych zasobów lub są niepoprawne";

/* errSecCSResourceRulesInvalid */
"-67053" = "nieprawidłowe reguły wyboru zasobów";

/* errSecCSReqInvalid */
"-67052" = "nieprawidłowe lub uszkodzone wymagania kodu";

/* errSecCSReqUnsupported */
"-67051" = "nieobsługiwany typ lub wersja wymagań kodu";

/* errSecCSReqFailed */
"-67050" = "nie udało się zaspokoić wymagań kodu";

/* errSecCSBadObjectFormat */
"-67049" = "nieprawidłowy lub niepasujący format pliku obiektu";

/* errSecCSInternalError */
"-67048" = "błąd wewnętrzny podsystemu Podpisywania kodu";

/* errSecCSHostReject */
"-67047" = "kod odrzucił jego hosta";

/* errSecCSNotAHost */
"-67046" = "ten kod nie jest głównym";

/* errSecCSSignatureInvalid */
"-67045" = "niewłaściwy format dla podpisu";

/* errSecCSHostProtocolRelativePath */
"-67044" = "naruszenie protokołu hosta - wymagana ścieżka absolutna gościa";

/* errSecCSHostProtocolContradiction */
"-67043" = "naruszenie protokołu hosta - sprzeczne tryby prowadzenia";

/* errSecCSHostProtocolDedicationError */
"-67042" = "naruszenie protokołu hosta - operacja nie jest dozwolona z/dla dedykowanego gościa";

/* errSecCSHostProtocolNotProxy */
"-67041" = "naruszenie protokołu hosta - prowadzenie proxy nie jest obciążone";

/* errSecCSHostProtocolStateError */
"-67040" = "naruszenie protokołu hosta - nieprawidłowe żądanie zmiany stanu gościa";

/* errSecCSHostProtocolUnrelated */
"-67039" = "naruszenie protokołu hosta - podany gość nie jest gościem podanego hosta";

/* errSecCSInvalidOperation */
"-67038" = "wymagana operacja nie jest prawidłowa";

/* errSecCSNotSupported */
"-67037" = "operacja nie obsługiwana dla tego typu kodu";

/* errSecCSCMSTooLarge */
"-67036" = "podpis zbyt duży do osadzenia";

/* errSecCSHostProtocolInvalidHash */
"-67035" = "naruszenie protokołu hosta - nieprawidłowy skrót gościa";

/* errSecCSStaticCodeChanged */
"-67034" = "program na dysku nie jest zgodny z uruchomionym";

/* errSecCSSigDBDenied */
"-67033" = "odmowa dostępu do bazy danych podpisów";

/* errSecCSSigDBAccess */
"-67032" = "nie można uzyskać dostępu do bazy danych podpisów";

/* errSecCSHostProtocolInvalidAttribute */
"-67031" = "host zwrócił nieprawidłowe lub niespójne atrybuty gościa";

/* errSecMisc_dskFulErr */
"-34" = "Dysk jest pełny.";

/* errSecMisc_nsvErr */
"-35" = "Nie można było znaleźć dysku. Mógł zostać wysunięty.";

/* errSecMisc_bdNamErr */
"-37" = "Próbowano otworzyć plik, którego nazwa zawiera nielegalny znak.";

/* errSecMisc_fnfErr */
"-43" = "Nie można było znaleźć pliku.";

/* errSecMisc_wPrErr */
"-44" = "Dysk jest zabezpieczony przed zapisem.";

/* errSecMisc_fLckdErr */
"-45" = "Plik jest zablokowany.";

/* errSecMisc_vLckdErr */
"-46" = "Wolumin jest zablokowany.";

/* errSecMisc_fBsyErr */
"-47" = "Plik jest zajęty. Może być używany w innym programie.";

/* errSecMisc_dupFNErr */
"-48" = "Plik z taką samą nazwą już istnieje.";

/* errSecMisc_opWrErr */
"-49" = "Plik jest już otwarty z prawem do zapisu.";

/* errSecMisc_volOffLinErr */
"-53" = "Ten wolumin nie jest już dostępny. Mógł zostać wysunięty.";

/* errSecMisc_permErr */
"-54" = "Nie można było otworzyć pliku. Może być używany w innym programie.";

/* errSecMisc_extFSErr */
"-58" = "Ten wolumin chyba nie jest zgodny.";

/* errSecMisc_wrPermErr */
"-61" = "Nie można było zapisać do pliku. Może być otwarty z niewłaściwymi uprawnieniami dostępu.";

/* errSecMisc_offLinErr */
"-65" = "Urządzenie pamięci masowej nie jest już dostępne. Mogło zostać wysunięte.";

/* errSecMisc_dirNFErr */
"-120" = "Nie można było znaleźć katalogu.";

/* errSecMisc_volGoneErr */
"-124" = "Wolumin serwera nie jest już dostępny. Mógł zostać odłączony.";

/* errSecMisc_userCanceledErr */
"-128" = "Operacja została anulowana przez użytkownika.";

/* errSecMisc_resNotFound */
"-192" = "Nie można było znaleźć wymaganych zasobów.";

/* errSecMisc_resFNotFound */
"-193" = "Brak jest wymaganych zasobów lub są uszkodzone.";

/* errSecMisc_icNoURLErr */
"-673" = "Podana lokacja (URL) jest niewłaściwego typu lub nie zawiera wystarczających informacji.";

/* errSecMisc_icConfigNotFoundErr */
"-674" = "Nie można było znaleźć programu pomocniczego, który otworzy podany URL.";

/* errSecMisc_cantGetFlavorErr */
"-1854" = "Brak jest lokacji (URL) tej rzeczy lub jest w niewłaściwym formacie.";

/* errSecMisc_afpAccessDenied */
"-5000" = "Odmówiono dostępu do tej rzeczy.";

/* errSecMisc_afpUserNotAuth */
"-5023" = "Uwierzytelnienie nie powiodło się. Hasło dla tego serwera mogło zostać zmienione od czasu dodania tej rzeczy do pęku kluczy.";

